read_verilog -sv wrapper.v
prep -top wrapper

hierarchy -check
proc
chformal -assume -early;

select wrapper/normalassert
chformal -remove
select *

memory -nomap;
flatten
setundef -undriven -expose;
sim -clock clk -reset rst -rstlen 1 -n 1 -w wrapper
write_btor  -s sanity.btor2
